---
action: global
title: ClickOnce appref-MS File created
status: experimental
description: Detects ClickOnce appref-MS file (.appref-ms)
references:
    - https://
tags:
    - attack.initial_access
    - attack.t1189
    - attack.t1192
    - attack.t1193
    - attack.t1194
author: Lionel PRAT
date: 2019/01/23
detection:
    condition: selection
level: low
---
# Windows MFT
logsource:
    product: windows
    service: mft
    definition: 'Rule for PLASO type fs:stat*'
detection:
    selection:
        parser: 'mft'
        name: '*/*.appref-ms'
---
# Windows File
logsource:
    product: windows
    service: file
    definition: 'Rule for PLASO type fs:stat*'
detection:
    selection:
        filename: '*/*.appref-ms'
---
# Sysmon: File Creation (ID 11)
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 11
        TargetFilename: '*\*.appref-ms'
---
# Sysmon: STREAM FILE (ID 15)
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 15
        TargetFilename: '*\*.appref-ms'

---
action: global
title: ClickOnce appref-MS File opened
status: experimental
description: Detects ClickOnce appref-MS File opened, use for correlation
references:
    - https://
tags:
    - attack.execution
author: Lionel PRAT
date: 2019/01/23
detection:
    condition: selection
level: low
---
#Windows Jump list by MFT
logsource:
    product: windows
    service: mft
    definition: 'Rule for PLASO type fs:stat*'
detection:
    selection:
        parser: 'mft'
        name: '*/AppData/Roaming/Microsoft/Windows/Recent/*.appref-ms.lnk'
---
#Windows Jump list by File
logsource:
    product: windows
    service: link
    definition: 'Rule for PLASO type windows:lnk:link'
detection:
    selection:
        filename: '*/AppData/Roaming/Microsoft/Windows/Recent/*.appref-ms.lnk'
---
# Sysmon: Process Creation (ID 1)
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 1
        CommandLine: '*ShOpenVerbShortcut*'
---
# Windows Security Eventlog: Process Creation with Full Command Line
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Policy : Detailed Tracking > Audit Process creation, Group Policy : Administrative Templates\System\Audit Process Creation'
detection:
    selection:
        EventID: 4688
        ProcessCommandLine: '*ShOpenVerbShortcut*'
---
# Sysmon: Registry Value Set (ID 13) MRU
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 13
        TargetObject: '*\Software\Microsoft\Windows\CurrentVersion\Explorer\FileExts\.appref-ms\OpenWithList'

